tap "adembc/tap"
tap "egoist/tap"
tap "go-task/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "quantonganh/tap"
tap "rsteube/tap"
# Run your GitHub Actions locally
brew "act"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Static checker for GitHub Actions workflow files
brew "actionlint"
# Platform built on V8 to build network applications
brew "node"
# Language Server for Ansible Files
brew "ansible-language-server"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Official Amazon AWS command-line interface
brew "awscli"
# Pyright fork with various improvements and built-in pylance features
brew "basedpyright"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 4.2+
brew "bash-completion@2"
# Language Server for Bash
brew "bash-language-server"
# Preexec and precmd functions for Bash (like Zsh)
brew "bash-preexec"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash scripts that integrate bat with various command-line tools
brew "bat-extras"
# Toolchain of the web
brew "biome"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# New way to see and navigate directory trees
brew "broot"
# Software library to render fonts
brew "freetype"
# Color-highlighted diff(1) output
brew "colordiff"
# Defines a standard way of committing rules and communicating it
brew "commitizen"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# General purpose Language Server
brew "efm-langserver"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Create thumbnails for your video files
brew "ffmpegthumbnailer"
# Fast and simple Node.js version manager
brew "fnm"
# Terminal JSON viewer
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GitHub command-line tool
brew "gh"
# GitHub MCP server
brew "github-mcp-server"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Extensions to follow Vincent Driessen's branching model
brew "git-flow"
# Clone a git repository into a standard location organised by domain and path
brew "git-grab"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Stricter gofmt
brew "gofumpt"
# Fast linters runner for Go
brew "golangci-lint"
# Language server for `golangci-lint`
brew "golangci-lint-langserver"
# Language server for the Go language
brew "gopls"
# Deliver Go binaries as fast and easily as possible
brew "goreleaser"
# Command-line interface for Hetzner Cloud
brew "hcloud"
# Post-modern modal text editor
brew "helix"
# Instant coding answers via the command-line
brew "howdoi"
# Run and Test HTTP Requests with plain text and curl
brew "hurl"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Simple terminal UI for git commands
brew "lazygit"
# Fast and powerful Git hooks manager for any type of projects
brew "lefthook"
# GNOME XML library
brew "libxml2"
# Powerful, lightweight programming language
brew "lua"
# Language Server for the Lua language
brew "lua-language-server"
# Language Server Protocol for Markdown
brew "marksman"
# Mac App Store command-line interface
brew "mas"
# Fly through your shell history
brew "mcfly"
# Modern and intuitive terminal-based text editor
brew "micro"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Interactive cheatsheet tool for the command-line
brew "navi"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Shell command parallelization utility
brew "parallel"
# Python package management tool
brew "poetry"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Modern replacement for ps written in Rust
brew "procs"
# Static type checker for Python
brew "pyright"
# Python Language Server for the Language Server Protocol
brew "python-lsp-server"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Language Server Protocol implementation for Ruff
brew "ruff-lsp"
# Simple terminal UI for search and replace
brew "serpl"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Cross-shell prompt for astronauts
brew "starship"
# TOML toolkit written in Rust
brew "taplo"
# Code-search similar to ack
brew "the_silver_searcher"
# Programmatically correct mistyped console commands
brew "thefuck"
# Text interface for Git repositories
brew "tig"
# Official tldr client written in Rust
brew "tlrc"
# Language Server Protocol implementation for TypeScript wrapping tsserver
brew "typescript-language-server"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# Access X11 clipboards from the command-line
brew "xclip"
# Friendly and fast tool for sending HTTP requests
brew "xh"
# Language Server for Yaml Files
brew "yaml-language-server"
# Extensible command-line tool to format YAML files
brew "yamlfmt"
# JavaScript package manager
brew "yarn"
# Fast, disk space efficient package manager
brew "pnpm"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Additional completion definitions for zsh
brew "zsh-completions"
# Modular, customizable, and blazing fast Zsh framework
brew "zimfw"
# A simple terminal UI for managing SSH connections.
brew "adembc/tap/lazyssh"
# An npm scripts runner written in Rust.
brew "egoist/tap/dum"
# Task runner / simpler Make alternative written in Go
brew "go-task/tap/go-task"
# A simple language server to just insert snippets into Helix.
brew "quantonganh/tap/snippets-ls"
# A multi-shell completion binary
brew "rsteube/tap/carapace"
# Application launcher and productivity software
cask "alfred"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Display management tool
cask "betterdisplay"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Tool to list all active shortcuts of the current application
cask "cheatsheet"
# Terminal-based AI coding assistant
cask "claude-code"
# Claude Squad CLI tool
brew "claude-squad"
# Voice and text chat software
cask "discord"
# Utility to show apps badges from the dock in the menu bar
cask "doll"
cask "font-hasklug-nerd-font"
cask "font-jetbrains-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
